---
kind: other
id: Properties.T:Autodesk.Revit.DB.LinkNode
source: html/6893ed69-8c1a-4d63-cfb7-97dce619f0a3.htm
---
# LinkNode Properties

Specifies whether the .NET object represents a valid Revit entity.